---
kind: method
id: M:Autodesk.Revit.DB.FillGrid.SetSegments(System.Collections.Generic.IList{System.Double})
source: html/3fd1bab1-b6bb-0e25-a293-c081afa6d006.htm
---
# Autodesk.Revit.DB.FillGrid.SetSegments Method

Sets the segments to the fill grid.

## Syntax (C#)
```csharp
public void SetSegments(
	IList<double> segArr
)
```

## Parameters
- **segArr** (`System.Collections.Generic.IList < Double >`) - The segments to be used.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null